balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128GP710.PIC
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA5PAD" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA5PAD" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PAD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA5CNT" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA5CNT" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-----nn--nn" edc:cname="DMA6CON" edc:desc="" edc:impl="0xf833" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-----00--00" edc:name="DMA6CON" edc:nzwidth="0x10" edc:por="00000-----00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE" edc:desc="" edc:mask="0x3" edc:name="AMODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="NULLW" edc:desc="" edc:mask="0x1" edc:name="NULLW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HALF" edc:desc="" edc:mask="0x1" edc:name="HALF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIR" edc:desc="" edc:mask="0x1" edc:name="DIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1" edc:name="SIZE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE0" edc:desc="" edc:mask="0x1" edc:name="AMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMODE1" edc:desc="" edc:mask="0x1" edc:name="AMODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="s--------nnnnnnn" edc:cname="DMA6REQ" edc:desc="" edc:impl="0x807f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--------0000000" edc:name="DMA6REQ" edc:nzwidth="0x10" edc:por="0--------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQSEL" edc:desc="" edc:mask="0x7f" edc:name="IRQSEL" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FORCE" edc:desc="" edc:mask="0x1" edc:name="FORCE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IRQSEL0" edc:desc="" edc:mask="0x1" edc:name="IRQSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL1" edc:desc="" edc:mask="0x1" edc:name="IRQSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL2" edc:desc="" edc:mask="0x1" edc:name="IRQSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL3" edc:desc="" edc:mask="0x1" edc:name="IRQSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL4" edc:desc="" edc:mask="0x1" edc:name="IRQSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL5" edc:desc="" edc:mask="0x1" edc:name="IRQSEL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL6" edc:desc="" edc:mask="0x1" edc:name="IRQSEL6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA6STA" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA6STA" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="STA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA6STB" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA6STB" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="STB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA6PAD" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA6PAD" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PAD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PAD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMA6CNT" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMA6CNT" edc:nzwidth="0x10" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-----nn--nn" edc:cname="DMA7CON" edc:desc="" edc:impl="0xf833" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-----00--00" edc:name="DMA7CON" edc:nzwidth="0x10" edc:por="00000-----00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE" edc:desc="" edc:mask="0x3" edc:name="AMODE" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="NULLW" edc:desc="" edc:mask="0x1" edc:name="NULLW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HALF" edc:desc="" edc:mask="0x1" edc:name="HALF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIR" edc:desc="" edc:mask="0x1" edc:name="DIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1" edc:name="SIZE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AMODE0" edc:desc="" edc:mask="0x1" edc:name="AMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMODE1" edc:desc="" edc:mask="0x1" edc:name="AMODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="s--------nnnnnnn" edc:cname="DMA7REQ" edc:desc="" edc:impl="0x807f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--------0000000" edc:name="DMA7REQ" edc:nzwidth="0x10" edc:por="0--------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQSEL" edc:desc="" edc:mask="0x7f" edc:name="IRQSEL" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FORCE" edc:desc="" edc:mask="0x1" edc:name="FORCE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IRQSEL0" edc:desc="" edc:mask="0x1" edc:name="IRQSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL1" edc:desc="" edc:mask="0x1" edc:name="IRQSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL2" edc:desc="" edc:mask="0x1" edc:name="IRQSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL3" edc:desc="" edc:mask="0x1" edc:name="IRQSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL4" edc:desc="" edc:mask="0x1" edc:name="IRQSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL5" edc:desc="" edc:mask="0x1" edc:name="IRQSEL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQSEL6" edc:desc="" edc:mask="0x1" edc:name="IRQSEL6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
